run/rhoVoF/jetCrossFlow_AMRkahip/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

// NOTE: different boundary conditions as in the original publication
// of Popinet in 2009
boundaryField
{
    inlet
    {
       
	//type		fixedValue;// for diagonal cases
	//value		uniform 0; //...
 	type            zeroGradient;
    }

    jetInlet
    {
        type zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(yMax|airBed)"
    {
	//type		fixedValue;//...
	//value		uniform 0; //...       
	type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
   
    zMinMax
    {
        type zeroGradient;
    }
}


// ************************************************************************* //
