run/rhoVoF/jetCrossFlow_AMRkahip/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        // This required bei InterIsoRhoFoam, but not by InterIsoFoam, why? (TT)
//        nAlphaCorr      2;
        advectionScheme   isoAdvection;
        isoFaceTol      1e-8;
        surfCellTol     1e-8;
        nAlphaBounds    3;
        snapTol         0;
        clip            false;
        cAlpha          1;
        nAlphaSubCycles 1;
        reconstructionScheme plicRDF;
		writeFields	true;        
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
    }

    p_rgh
    {
        solver          GAMG; //PCG;
        smoother 	DICGaussSeidel; //preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.0;
        minIter         10;
    }

    p_rghFinal
    {
        $p_rgh;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.0;
        minIter         3;
    }

    UFinal
    {
        $U; 
    }

    rho 
    {
        solver diagonal;
        nAlphaBounds    3;
        snapTol         0;
        clip            false;
    }

    rhoFinal
    {
        $rho;
    }
}

// lentSC
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}

// ************************************************************************* //
