run/rhoVoF/jetCrossFlow_AMRkahip/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Preload any required fields (optional)
readFields      ( U);

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

/*        constants
        {
            limit 1e-6;
        }

        variables
        (
            "radius = 0.001"
        );

        fieldMask
        #{
          alpha.water > $[(scalar)constants.limit]
        #}; 
*/
		condition
         #{
             "patch() == jetInlet"
         #};

        expression
        #{
           "vector(0, -21.434*pow(mag(pos())/0.001,3) + 15.512*pow(mag(pos())/0.001,2) - 2.5722*(mag(pos())/0.001) + 8.6504, 0)" //vector (0.0, 0.0, -3.1)
        #};
		
		
    }
);


// ************************************************************************* //
